Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If the first operand is to use smart matching, then both operands will do so; if it is not, then the second argument will not be either.
es_es: Si el primer operando utiliza coincidencia inteligente, entonces se aplicará a ambos operandos; si no es así, entonces, ni el segundo argumento lo usará.

source: By default floating point numbers substituted inside strings use the dot (".") as the decimal separator.
es_es: De forma predeterminada los números en punto flotante sustituidos dentro de cadenas usan el punto (".") como separador decimal.

source: The F<MANIFEST> file in the root of the source tree contains a list of every file in the Perl core, as well as a brief description of each file.
es_es: El archivo F<MANIFEST> del directorio raíz del árbol de código fuente contiene una lista de todos los archivos incluidos en el núcleo de Perl, así como una breve descripción de cada archivo.

source: That's why it's good to use references sometimes.
es_es: Es por eso que es bueno, en algunas situaciones, utilizar referencias.

source: Cwd upgraded to version 3.01 (as part of the new PathTools distribution)
es_es: Cwd actualizado a la versión 3.01 (como parte de la nueva distribución PathTools)

source: Perl 5.13.0 represents eight days of development since Perl 5.12.0 and contains 3,766 lines of changes across 151 files from 29 authors and committers.
es_es: Perl 5.13.0 representa ocho días de desarrollo desde Perl 5.12.0, y contiene 3.766 líneas de cambios a través de 151 archivos de 29 autores.

source: Specify Perl version requirements with C<use>
es_es: Especifique los requisitos de la versión de Perl con C<use>

source: Scalar or list context propagates down to the right operand if it is evaluated.
es_es: Los contextos escalar o lista se propagan hacia el operando de la derecha si es evaluado.

source: \S non-whitespace character
es_es: \S un carácter que no sea un espacio en blanco

source: But from time to time, Perl's notions differ substantially from what the author honestly meant.
es_es: Pero de vez en cuando, las nociones de Perl difieren sustancialmente de lo que el autor, honestamente, quería decir.

source: It's probably best to spend a full day learning all this, but the basics can be learned in minutes.
es_es: Probablemente lo mejor sea dedicar un día entero a esta tarea, pero para aprender los conceptos básicos bastan unos pocos minutos.

source: is equivalent to:
es_es: es equivalente a:

source: You can test whether it conforms to CPAN by using
es_es: Se puede comprobar si se ajusta a CPAN utilizando

source: If @foo exists, Perl takes a good guess about C<[bar]>, and is almost always right.
es_es: Si @foo existe, Perl tiene una buena pista acerca de C<[bar]>, y casi siempre acierta.

source: =head2 UTF-8 cache optimisation
es_es: =head2 Optimización del caché UTF-8

source: If you call a subroutine by a tainted name, and if it defers to an AUTOLOAD function, then $AUTOLOAD will be (correctly) tainted.
es_es: Si llama a una subrutina con un nombre contaminado, y ella remite a una función AUTOLOAD, entonces $AUTOLOAD quedará (correctamente) contaminado.

source: For that, use C<scalar @array> and C<scalar keys %hash>, respectively.
es_es: Para ello, utilice C<scalar @array> y C<scalar keys %hash>, respectivamente.

source: But as you might well imagine, this can get pretty rough on the reader.
es_es: Pero como se podrá imaginar, esto puede ser bastante duro para el lector.

source: When evaluated as a string it is treated as C<''>, but as a number, it is treated as 0.
es_es: Cuando es evaluado como cadena es tratado como C<''>, pero como número es tratado como 0.

source: perlplan9 Perl notes for Plan 9
es_es: perlplan9 Notas para Plan 9

source: In scalar context, a single string consisting of all output is returned.
es_es: En contexto escalar, se devuelve una sola cadena consistente en toda la salida.

source: The syntax for this mechanism is almost the same as for most C preprocessors: it matches the regular expression
es_es: La sintaxis de este mecanismo es el mismo que para la mayoría de preprocesadores de C: coincide con la expresión regular

source: Thus, C<$a // $b> is similar to C<defined($a) || $b> (except that it returns the value of C<$a> rather than the value of C<defined($a)>) and yields the same result as C<defined($a) ? $a : $b> (except that the ternary-operator form can be used as a lvalue, while C<$a // $b> cannot).
es_es: Por lo tanto, C<$a // $b> es similar a C<defined($a) || $b> (excepto que devuelve el valor de C<$a> en lugar del valor de C<defined($a)>) y es equivalente exactamente a C<defined($a) ? $a : $b> (excepto que el operador ternario puede ser usado como ivalor, mientras que C<$a // $b>, no).

source: =item C<< (?>pattern) >> X<backtrack> X<backtracking> X<atomic> X<possessive>
es_es: =item C<< (?>patrón) >> X<backtrack> X<backtracking> X<retroceso> X<retrocediendo> X<atómico> X<posesivo>

source: =item getpwnam NAME X<getpwnam> X<getgrnam> X<gethostbyname> X<getnetbyname> X<getprotobyname> X<getpwuid> X<getgrgid> X<getservbyname> X<gethostbyaddr> X<getnetbyaddr> X<getprotobynumber> X<getservbyport> X<getpwent> X<getgrent> X<gethostent> X<getnetent> X<getprotoent> X<getservent> X<setpwent> X<setgrent> X<sethostent> X<setnetent> X<setprotoent> X<setservent> X<endpwent> X<endgrent> X<endhostent> X<endnetent> X<endprotoent> X<endservent>
es_es: =item getpwnam NOMBRE X<getpwnam> X<getgrnam> X<gethostbyname> X<getnetbyname> X<getprotobyname> X<getpwuid> X<getgrgid> X<getservbyname> X<gethostbyaddr> X<getnetbyaddr> X<getprotobynumber> X<getservbyport> X<getpwent> X<getgrent> X<gethostent> X<getnetent> X<getprotoent> X<getservent> X<setpwent> X<setgrent> X<sethostent> X<setnetent> X<setprotoent> X<setservent> X<endpwent> X<endgrent> X<endhostent> X<endnetent> X<endprotoent> X<endservent>

source: Unary "+" has no effect whatsoever, even on strings.
es_es: Unario "+" no tiene efecto alguno, incluso en cadenas.

source: The length of an array is a scalar value.
es_es: La longitud de un array es un valor escalar.

source: When each filter is called by Perl, a local copy of C<$_> will contain the key or value to be filtered.
es_es: Cuando Perl llama a uno de estos filtros, una copia local de C<$_> contendrá la clave o el valor que se va a filtrar.

source: However, "native" floats have a most fundamental restriction: they may represent only those numbers which have a relatively "short" representation when converted to a binary fraction.
es_es: En cambio, existe una restricción intrínseca para los números de punto flotante "nativos": solo se pueden representar los números que tengan una representación relativamente "corta" al convertirse en una fracción binaria.

source: While short identifiers like C<$gotit> are probably ok, use underscores to separate words in longer identifiers.
es_es: Mientras identificadores cortos como C<$leenombre> están bien, use guiones bajos para separar palabras en los identificadores más largos.

source: It might do two totally different things.
es_es: Puede hacer dos cosas totalmente diferentes.

source: to regenerate uconfig.h.
es_es: para regenerar uconfig.h.

source: Unlike in the shell, if SIGNAL is negative, it kills process groups instead of processes.
es_es: A diferencia del shell, si SEÑAL es negativo, mata el grupo de procesos en lugar de a los procesos.

source: Deleting from C<%ENV> modifies the environment.
es_es: Borrando de C<%ENV> modifica el entorno.

source: The maintenance versions are stable, and have an even number as the minor release (i.e. perl5.10.x, where 10 is the minor release).
es_es: Las versiones de mantenimiento son estables; en estas versiones se utiliza un número par como número de versión secundaria (p.ej., perl5.10.x, donde 10 es el número de versión secundaria).

source: Not implemented.
es_es: No implementado.

source: But that isn't going to match; at least, not the way you're hoping.
es_es: Pero eso no va a coincidir, al menos, no de la forma en que lo está esperando.

source: # Install DBM Filters
es_es: # Instalar filtros DBM

source: C<attrs> upgraded to version 1.02
es_es: C<attrs> actualizado a la versión 1.02

source: See L<perlvar> for more details on the C<%+> and C<%-> hashes.
es_es: Vea C<perlvar> para más detalles sobre los hash C<%+> y C<%->.

source: A bareword argument to chdir() is now recognized as a file handle.
es_es: Una palabra sencilla como argumento a chdir() ahora es reconocida como un identificador de archivo.

source: See http://www.perl.com/CPAN (without a slash at the end) for how this process works.
es_es: Visite http://www.perl.com/CPAN (sin barra diagonal al final) para ver cómo funciona este proceso.

source: Map always returns a list, which can be assigned to a hash such that the elements become key/value pairs.
es_es: Map siempre devuelve una lista, que puede ser asignada a un hash de tal manera que los elementos serán parejas de claves y valores.

source: Note that reversing an array to itself (as in C<@a = reverse @a>) will preserve non-existent elements whenever possible, i.e., for non magical arrays or tied arrays with C<EXISTS> and C<DELETE> methods.
es_es: Tenga en cuenta que invertir un array en sí mismo (como en C<@a = reverse @a>) preservará elementos inexistentes cuando le sea posible, es decir, para arrays no mágicos o arrays enlazados con métodos C<EXISTS> y C<DELETE>.

source: perlrequick Perl regular expressions quick start
es_es: perlrequick Guía rápida de las expresiones regulares

source: Being parsimonious on filehandles is also useful (besides being parsimonious) for example when something is dependent on file descriptors, like for example locking using flock().
es_es: Ser parco en identificadores de archivo también es útil (además de ser parsimoniosos), por ejemplo cuando algo depende de descriptores de archivo, como por ejemplo, el uso del bloqueo flock().

source: The hash randomisation mentioned in L</Incompatible Changes> is definitely problematic: it will wake dormant bugs and shake out bad assumptions.
es_es: La asignación al azar de hash mencionado en L</Cambios Incompatibles> es definitivamente un problema: despertará errores latentes y sacudirá a las malas suposiciones.

source: Add more great circle routines: C<great_circle_waypoint> and C<great_circle_destination>
es_es: Añade más rutinas para cálculos de arcos esféricos: C<great_circle_waypoint> y C<great_circle_destination>

source: || die "can't open UTF-8 encoded filename: $!";
es_es: || die "no puedo abrir archivo codificado en UTF-8: $!";

source: =head2 OpenBSD core dumps from getprotobyname_r and getservbyname_r with ithreads
es_es: =head2 OpenBSD vuelca el núcleo desde getprotobyname_r y getservbyname_r con ithreads

source: @articles = sort {$b <=> $a} @files;
es_es: @articulos = sort {$b <=> $a} @archivos;

source: In scalar context, evaluating a filehandle in angle brackets yields the next line from that file (the newline, if any, included), or C<undef> at end-of-file or on error.
es_es: En contexto escalar, la evaluación de un identificador de archivo entre ángulos retorna la siguiente línea de ese archivo (con el carácter de salto de línea, en su caso, incluido), o C<undef> al final del archivo o en caso de error.

source: With format C<h>, the first character of the pair determines the least-significant nybble of the output character; with format C<H>, it determines the most-significant nybble.
es_es: Con el formato C<h>, el primer carácter del par determina el nible menos significativo de la salida de caracteres; con el formato C<H>, determina el nible más significativo.

source: Beyond that, he has other preferences that aren't so strong:
es_es: Aparte de eso, él tiene otras preferencias que no son tan estrictas:

source: $no_caps_here function scope my() or local() variables
es_es: $sin_mayusculas Ámbito de función, variables my() o local()

source: =item * Module tests
es_es: =item * Pruebas de módulos

source: Just understand what you're getting yourself into.
es_es: Sólo entienda lo que te está metiendo.

source: # Titlecase words in the last 30 characters only
es_es: # Solo palabras con capitulares en los últimos 30 caracteres

source: Here's a summary of the possible predicates:
es_es: He aquí un resumen de los predicados posibles:

source: Consider writing a module or object class.
es_es: Considere escribir un módulo o una clase de objetos.

source: Currently, that environment variable is not getting populated by a combination of C<Config> entries and C<ExtUtil::MakeMaker>.
es_es: En la actualidad, esta variable de entorno no está siendo publicitada por una combinación de entradas en C<Config> y C<ExtUtil::MakeMaker>.

source: C<ptar> is a pure perl implementation of C<tar>, that comes with C<Archive::Tar>.
es_es: C<ptar> es una implementación en puro perl de C<tar>, que viene incluido con C<Archive::Tar>.

source: If the source number is outside of the limits representable in the target form, a representation of the closest limit is used.
es_es: Si el número de origen está fuera de los límites representables en la forma de destino, se usa una representación del límite más cercano.

source: X<identifier>
es_es: X<identifier> X<identificador>

source: Nicholas Clark changed the string buffer allocation so that it is now rounded up to the next multiple of 4 (or 8 on platforms with 64 bit pointers).
es_es: Nicholas Clark cambió la asignación del búfer de cadena de texto por lo que ahora es redondeado al siguiente múltiplo de 4 (u 8 en las plataformas con punteros de 64 bits).

source: This doesn't work if you explicitly specify a loop variable, as in C<for $item (@array)>.
es_es: Esto no funciona si explícitamente especifica una variable de bucle, como en C<for $item (@array)>.

source: The former is what the Perl debugger uses, while the latter generates parsable Perl code.
es_es: El primero es el que el depurador de Perl utiliza, mientras que el segundo genera código Perl interpretable de forma directa.

source: The range operator (in list context) makes use of the magical auto-increment algorithm if the operands are strings.
es_es: El operador rango (en contexto de lista) hace uso del algoritmo auto-incremental mágico, si los operandos son cadenas.

source: =item utime LIST
es_es: =item utime LISTA

source: sub newopen {
es_es: sub nuevoopen {

source: 5.8.2 introduced a bugfix which accidentally broke the compilation of Perl extensions written in C++
es_es: 5.8.2 introdujo una corrección de errores que rompió accidentalmente la compilación de las extensiones Perl escritas en C++

source: The result is something like this:
es_es: El resultado es algo como esto:

source: If you have a library that provides an API, you can make any component of it available as just another Perl function or variable using a Perl extension written in C or C++ and dynamically linked into your main perl interpreter.
es_es: Si tiene una biblioteca que proporciona una API, puede hacer que cualquier componente de la misma esté disponible como cualquier otra función o variable de Perl mediante una extensión programada en C o C++, y vinculada dinámicamente al intérprete perl principal.

source: c Do not reset search position on a failed match when /g is in effect.
es_es: c No reinicia la posición de búsqueda en una coincidencia fallida cuando /g esta activa.

source: By default, whenever Perl writes to a DBM database it always writes the key and value as strings.
es_es: de manera predeterminada, cuando Perl escribe en una base de datos DBM, siempre escribe la clave y el valor como cadenas.

source: It returns the total number of characters removed from all its arguments.
es_es: Devuelve el número total de caracteres eliminados de todos sus argumentos.

source: Create a symlink for libperl:
es_es: Crear un enlace simbólico para libperl:

source: These take much longer on MPE/iX than on a Unix system, because of a slow forking, mostly.
es_es: Esto tarda mucho más en MPE/iX que en un sistema Unix, debido, sobre todo, a un sistema lento de C<fork>.

source: =item Parameter passing
es_es: =item Paso de parámetros

source: In practice this is unlikely unless your code contains a very complex nesting of anonymous subs, evals and lexicals.
es_es: En la práctica esto es poco probable a menos que el código contenga un agrupamiento muy complejo de subs anónimas, evals y léxicas.

source: Some of the most common values are C<O_RDONLY> for opening the file in read-only mode, C<O_WRONLY> for opening the file in write-only mode, and C<O_RDWR> for opening the file in read-write mode.
es_es: Algunos de los valores más comunes son C<O_RDONLY> para abrir el archivo en modo de sólo lectura, C<O_WRONLY> para abrir el archivo en modo de sólo escritura, y C<O_RDWR> para abrir el archivo en modo lectura-escritura.

source: if (crypt($word, $pwd) ne $pwd) {
es_es: if (crypt($palabra, $pwd) ne $pwd) {

source: Upgraded from version 1.00 to 1.01.
es_es: Actualizado desde la versión 1.00 a la 1.01.

source: =head2 New "Use of freed value in iteration"
es_es: =head2 Nuevo "I<Use of freed value in iteration>" (Uso de un valor liberado en la iteración)

source: A reference to the subroutine itself is passed in as C<$_[0]>.
es_es: Una referencia a la propia subrutina es pasada en C<$_[0]>.

source: Fortunately, it's usually correct for ambiguous cases.
es_es: Afortunadamente, por lo general es correcta para los casos ambiguos.

source: I<Native> here means "a format supported by the C compiler which was used to build perl".
es_es: Aquí I<nativo> significa "formato admitido por el compilador de C que se usó para compilar perl".

source: Otherwise, if the string starts with a plus or minus, a string starting with the opposite sign is returned.
es_es: De otra manera, si el string comienza con un signo más o un menos, se devuelve un string que comience con el signo opuesto.

source: Similar in spirit to C<(?{0})> but more efficient.
es_es: Similar en espíritu a C<(?{0})> pero más eficiente.

source: This has been fixed, along with several other bugs, notably in bounds checking.
es_es: Esto se ha corregido, junto con otros errores, sobre todo en la comprobación de los límites.

source: Original Result Warns?
es_es: Original Resultado ¿Advertencia?

source: It's available when C<use feature 'switch'> is in effect.
es_es: Está disponible cuando C<use feature 'switch'> está en vigor.

source: Be consistent.
es_es: Sea coherente.

source: A subtest of the C<ext/Sys/Syslog/t/syslog.t> test fails.
es_es: Una subprueba del test C<ext/Sys/Syslog/t/syslog.t> falla.

source: chomp($string = <<'END');
es_es: chomp($cadena = <<'END');

source: Unlike a second C<my> declaration, which will bind the name to a fresh variable, a second C<our> declaration in the same package, in the same scope, is merely redundant.
es_es: A diferencia de una segunda declaración de C<my>, que unirá el nombre a una nueva variable, una segunda declaración de C<our> en el mismo paquete, en el mismo ámbito, es simplemente redundante.

source: =head2 What are the Perl newsgroups on Usenet?
es_es: =head2 ¿Qué son los grupos de noticias de Perl en Usenet?

source: then C<$a> and C<$b> are C<$main::a> and C<$main::b> (or C<$::a> and C<$::b>), but if you're in the C<FooPack> package, it's the same as typing
es_es: entonces C<$a> y C<$b> son C<$main::a> y C<$main::b> (o C<$::a> y C<$::b>), pero si está en el paquete C<FooPack>, es lo mismo que escribir

source: perlop - Perl operators and precedence
es_es: perlop - Operadores de Perl y precedencia

source: The C<:bytes>, C<:crlf>, C<:utf8>, and any other directives of the form C<:...>, are called I/O I<layers>.
es_es: C<:bytes>, C<:crlf>, C<:utf8>, y cualquier otra directiva de la forma C<:...>, se llaman I<capas> I/O.

source: See L<perldata> for more details.
es_es: Ver L<perldata> para más detalles.

source: Here's a simple example being:
es_es: He aquí un ejemplo sencillo:

source: =head2 The most popular books
es_es: =head2 Los libros más populares

source: The lower-level loops are I<interrupted> (that is, the loop is broken) when Perl detects that a repeated expression matched a zero-length substring.
es_es: Los bucles de bajo nivel son I<interrumpidos> (es decir, el bucle es roto) cuando Perl detecta que una repetida expresión coincide con una subcadena de longitud cero.

source: B<Note> that this pattern does not behave the same way as the equivalent PCRE or Python construct of the same form.
es_es: B<Note> que este patrón no se comporta del mismo modo que la misma construcción equivalente en PCRE o Python.

source: A common case is that the option is an integer, in which case the result is a packed integer, which you can decode using C<unpack> with the C<i> (or C<I>) format.
es_es: Un caso común es que la opción sea un entero, en cuyo caso el resultado es un entero empaquetado, que podrá decodificar usando C<unpack> con el formato C<i> (o C<I>).

source: Note that the value of an actual array in scalar context is the length of the array; the following assigns the value 3 to $foo:
es_es: Tenga en cuenta que el valor actual de un array en contexto escalar es la longitud del array; lo siguiente asigna el valor 3 a $foo:

source: Here's how to use C<m//gc> with C<\G>:
es_es: Aquí está cómo se usa C<m//gc> con C<\G>:

source: To do either of those, you have to use the C<$SIG{__WARN__}> facility, or turn off warnings inside the BLOCK or EXPR using S<C<no warnings 'all'>>.
es_es: Para hacer cualquiera de estas dos cosas debe usar C<$SIG{__WARN__}>, o desactivar los avisos dentro del BLOQUE o EXPR usando S<C<no warnings 'all'>>.

source: C<VSTRING> is returned if the reference points to a L<version string|perldata/"Version Strings">.
es_es: C<VSTRING> se devuelve si la referencia apunta a una L<version string|perldata/"Cadenas de versión">.

source: @ary = glob($pattern); # expand filenames
es_es: @ary = glob($patron); # expandir los nombres de los archivos

source: @contact = sort find_records(@key);
es_es: @contacto = sort busca_registros(@claves);

source: In list context, returns
es_es: En contexto lista, devuelve

source: C<DynaLoader> upgraded but unfortunately we're not able to increment its version number :-(
es_es: C<DynaLoader> actualizado, pero, desafortunadamente, no somos capaces de aumentar su número de versión :-(

source: However, because there are I<many> other lowercase Greek characters than just those, to match lowercase Greek characters in a regular expression, you would use the pattern C</(?:(?=\p{Greek})\p{Lower})+/>.
es_es: Sin embargo, porque existen I<muchos> otros caracteres griegos en minúscula que estos, para buscar por caracteres griegos en minúscula en una expresión regular, se utiliza el patrón C</(?:(?=\p{Greek})\p{Lower})+/>.

source: You can also embed newlines directly in your strings, i.e., they can end on a different line than they begin.
es_es: También puede incrustar directamente caracteres de nueva línea dentro de sus cadenas, es decir, que puede terminar en una línea diferente de cuando empezaron.

source: perl571delta Perl changes in version 5.7.1
es_es: perl571delta Cambios en la versión 5.7.1

source: The I<sequence-item> must not have a repeat count.
es_es: La I<secuencia-item> no debe tener un contador de repeticiones.

source: In short, Perl 4 is the past, Perl 5 is the present, and Perl 6 is the future.
es_es: Se puede resumir de la siguiente manera: Perl 4 es el pasado, Perl 5 es el presente y Perl 6 es el futuro.

source: Some of the ones we've already seen include C<print>, C<sort> and C<reverse>.
es_es: Ya hemos visto algunas funciones, como C<print>, C<sort> y C<reverse>.

source: Fix pure-perl version of C<refaddr> to avoid blessing an un-blessed reference
es_es: Arreglada la versión en puro perl de C<refaddr> para evitar la bendición de una referencia no bendecida
